jmeter-tests/jmeter.log
2026-06-18 00:47:22,707 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-06-18 00:47:22,742 INFO o.a.j.JMeter: Loading user properties from: /opt/homebrew/Cellar/jmeter/5.6.3/libexec/bin/user.properties
2026-06-18 00:47:22,743 INFO o.a.j.JMeter: Loading system properties from: /opt/homebrew/Cellar/jmeter/5.6.3/libexec/bin/system.properties
2026-06-18 00:47:22,752 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-06-18 00:47:22,752 INFO o.a.j.JMeter: Version 5.6.3
2026-06-18 00:47:22,752 INFO o.a.j.JMeter: java.version=21.0.11
2026-06-18 00:47:22,752 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2026-06-18 00:47:22,752 INFO o.a.j.JMeter: os.name=Mac OS X
2026-06-18 00:47:22,752 INFO o.a.j.JMeter: os.arch=aarch64
2026-06-18 00:47:22,752 INFO o.a.j.JMeter: os.version=26.3.1
2026-06-18 00:47:22,752 INFO o.a.j.JMeter: file.encoding=UTF-8
2026-06-18 00:47:22,752 INFO o.a.j.JMeter: java.awt.headless=true
2026-06-18 00:47:22,752 INFO o.a.j.JMeter: Max memory     =1073741824
2026-06-18 00:47:22,753 INFO o.a.j.JMeter: Available Processors =8
2026-06-18 00:47:22,768 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-06-18 00:47:22,768 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-06-18 00:47:22,768 INFO o.a.j.JMeter: JMeterHome=/opt/homebrew/Cellar/jmeter/5.6.3/libexec
2026-06-18 00:47:22,768 INFO o.a.j.JMeter: user.dir  =/Users/mahajanpiyush/Desktop/redbus-master/jmeter-tests
2026-06-18 00:47:22,768 INFO o.a.j.JMeter: PWD       =/Users/mahajanpiyush/Desktop/redbus-master/jmeter-tests
2026-06-18 00:47:22,783 INFO o.a.j.JMeter: IP: 192.168.1.9 Name: 192.168.1.9 FullName: 192.168.1.9
2026-06-18 00:47:22,801 INFO o.a.j.s.FileServer: Default base='/Users/mahajanpiyush/Desktop/redbus-master/jmeter-tests'
2026-06-18 00:47:22,803 INFO o.a.j.s.FileServer: Set new base='/Users/mahajanpiyush/Desktop/redbus-master/jmeter-tests'
2026-06-18 00:47:23,040 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-06-18 00:47:23,095 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-06-18 00:47:23,104 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-06-18 00:47:23,109 INFO o.a.j.s.SaveService: Loading file: redbus-api-load-test.jmx
2026-06-18 00:47:23,588 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-06-18 00:47:23,588 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-06-18 00:47:23,589 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-06-18 00:47:23,589 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-06-18 00:47:23,589 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-06-18 00:47:23,589 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-06-18 00:47:23,658 INFO o.a.j.JMeter: Creating summariser <summary>
2026-06-18 00:47:23,684 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-06-18 00:47:23,685 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-06-18 00:47:23,685 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-06-18 00:47:23,692 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-06-18 00:47:23,692 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-06-18 00:47:23,785 INFO o.a.j.r.ClassFinder: Will scan jar /opt/homebrew/Cellar/jmeter/5.6.3/libexec/lib/ext/jmeter-plugins-manager-1.9.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2026-06-18 00:47:23,964 INFO o.a.j.JMeter: Running test (1781723843964)
2026-06-18 00:47:24,013 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : API Load Thread Group
2026-06-18 00:47:24,013 INFO o.a.j.e.StandardJMeterEngine: Starting 10 threads for group API Load Thread Group.
2026-06-18 00:47:24,013 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-06-18 00:47:24,013 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=10 ramp-up=5 delayedStart=false
2026-06-18 00:47:24,026 INFO o.a.j.t.JMeterThread: Thread started: API Load Thread Group 1-1
2026-06-18 00:47:24,030 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-06-18 00:47:24,031 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-06-18 00:47:24,068 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = 192.168.1.9
2026-06-18 00:47:24,083 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-06-18 00:47:24,087 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-06-18 00:47:24,087 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-06-18 00:47:24,087 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-06-18 00:47:24,087 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-06-18 00:47:24,526 INFO o.a.j.t.JMeterThread: Thread started: API Load Thread Group 1-2
2026-06-18 00:47:25,022 INFO o.a.j.t.JMeterThread: Thread started: API Load Thread Group 1-3
2026-06-18 00:47:25,523 INFO o.a.j.t.JMeterThread: Thread started: API Load Thread Group 1-4
2026-06-18 00:47:26,018 INFO o.a.j.t.JMeterThread: Thread started: API Load Thread Group 1-5
2026-06-18 00:47:26,517 INFO o.a.j.t.JMeterThread: Thread started: API Load Thread Group 1-6
2026-06-18 00:47:27,017 INFO o.a.j.t.JMeterThread: Thread started: API Load Thread Group 1-7
2026-06-18 00:47:27,516 INFO o.a.j.t.JMeterThread: Thread started: API Load Thread Group 1-8
2026-06-18 00:47:28,016 INFO o.a.j.t.JMeterThread: Thread started: API Load Thread Group 1-9
2026-06-18 00:47:28,516 INFO o.a.j.t.JMeterThread: Thread started: API Load Thread Group 1-10
2026-06-18 00:47:30,017 INFO o.a.j.r.Summariser: summary +     90 in 00:00:06 =   14.9/s Avg:   394 Min:   218 Max:  1658 Err:     0 (0.00%) Active: 10 Started: 10 Finished: 0
2026-06-18 00:47:35,169 INFO o.a.j.t.JMeterThread: Thread is done: API Load Thread Group 1-1
2026-06-18 00:47:35,170 INFO o.a.j.t.JMeterThread: Thread finished: API Load Thread Group 1-1
2026-06-18 00:47:35,744 INFO o.a.j.t.JMeterThread: Thread is done: API Load Thread Group 1-4
2026-06-18 00:47:35,744 INFO o.a.j.t.JMeterThread: Thread finished: API Load Thread Group 1-4
2026-06-18 00:47:35,870 INFO o.a.j.t.JMeterThread: Thread is done: API Load Thread Group 1-3
2026-06-18 00:47:35,870 INFO o.a.j.t.JMeterThread: Thread finished: API Load Thread Group 1-3
2026-06-18 00:47:35,872 INFO o.a.j.t.JMeterThread: Thread is done: API Load Thread Group 1-2
2026-06-18 00:47:35,872 INFO o.a.j.t.JMeterThread: Thread finished: API Load Thread Group 1-2
2026-06-18 00:47:35,985 INFO o.a.j.t.JMeterThread: Thread is done: API Load Thread Group 1-5
2026-06-18 00:47:35,985 INFO o.a.j.t.JMeterThread: Thread finished: API Load Thread Group 1-5
2026-06-18 00:47:36,585 INFO o.a.j.t.JMeterThread: Thread is done: API Load Thread Group 1-6
2026-06-18 00:47:36,585 INFO o.a.j.t.JMeterThread: Thread finished: API Load Thread Group 1-6
2026-06-18 00:47:37,052 INFO o.a.j.t.JMeterThread: Thread is done: API Load Thread Group 1-7
2026-06-18 00:47:37,052 INFO o.a.j.t.JMeterThread: Thread finished: API Load Thread Group 1-7
2026-06-18 00:47:37,810 INFO o.a.j.t.JMeterThread: Thread is done: API Load Thread Group 1-8
2026-06-18 00:47:37,811 INFO o.a.j.t.JMeterThread: Thread finished: API Load Thread Group 1-8
2026-06-18 00:47:38,240 INFO o.a.j.t.JMeterThread: Thread is done: API Load Thread Group 1-9
2026-06-18 00:47:38,240 INFO o.a.j.t.JMeterThread: Thread finished: API Load Thread Group 1-9
2026-06-18 00:47:38,713 INFO o.a.j.t.JMeterThread: Thread is done: API Load Thread Group 1-10
2026-06-18 00:47:38,713 INFO o.a.j.t.JMeterThread: Thread finished: API Load Thread Group 1-10
2026-06-18 00:47:38,717 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-06-18 00:47:38,720 INFO o.a.j.r.Summariser: summary +    210 in 00:00:09 =   24.1/s Avg:   324 Min:   218 Max:   968 Err:     0 (0.00%) Active: 0 Started: 10 Finished: 10
2026-06-18 00:47:38,721 INFO o.a.j.r.Summariser: summary =    300 in 00:00:15 =   20.3/s Avg:   345 Min:   218 Max:  1658 Err:     0 (0.00%)